app/controllers/feed_controller.rb

SELECT DISTINCT feed_name FROM `feed_items`
---
  def index
    # @feeds = FeedItem.find(:all, :select => 'DISTINCT feed_name')
    @feeds = FeedItem.select(:feed_name).distinct