app/controllers/feed_controller.rb

SELECT * FROM `feed_items` WHERE (`feed_items`.`feed_name` = 'feed-b')
---
  def show
    @feed_items = FeedItem.find_all_by_feed_name(params[:feed_name])